## Example 1: Pandas - Grouping and Aggregation

In [1]:
import pandas as pd
# Creating a DataFrame
data = {'Category': ['A','B','A','B','C','C','A'],
        'Value': [10, 20, 15, 25, 35, 45, 30]}
df = pd.DataFrame(data)
print('Data:')
df

Data:

  Category  Value
0        A     10
1        B     20
2        A     15
3        B     25
4        C     35
5        C     45
6        A     30

In [2]:
# Grouping by category and calculating the sum and mean
grouped = df.groupby('Category').agg({'Value': ['sum','mean']})

print('Grouped DataFrame with Aggregations:')
grouped

Grouped DataFrame with Aggregations:

         Value
           sum       mean
Category
A           55  18.333333
B           45  22.500000
C           80  40.000000

## Example 2: Pandas - MultiIndex DataFrame Operations

In [3]:
import pandas as pd

# Creating a MultiIndex DataFrame
arrays = [['A', 'A', 'B', 'B'], [2020, 2021, 2020, 2021]]
index = pd.MultiIndex.from_arrays(arrays, names=('Category', 'Year'))
data = [100, 150, 200, 250]
df = pd.DataFrame(data, index=index, columns=['Sales'])
print('Data:')
df

Data:

               Sales
Category Year
A        2020    100
         2021    150
B        2020    200
         2021    250

In [4]:
# Accessing data in a MultiIndex DataFrame
sales_in_2020 = df.xs(2020, level='Year')

print('Sales Data in 2020:')
sales_in_2020

Sales Data in 2020:

          Sales
Category
A           100
B           200

## Example 3: Pandas - Using Apply with Lambda Functions

In [5]:
import pandas as pd

# Creating a DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie'], 'Score': [85, 90, 95]}
df = pd.DataFrame(data)
df

      Name  Score
0    Alice     85
1      Bob     90
2  Charlie     95

In [6]:
# Applying a lambda function to modify scores
df['Adjusted Score'] = df['Score'].apply(lambda x: x + 5 if x < 90 else x)

print('DataFrame with Adjusted Scores:')
df

DataFrame with Adjusted Scores:

      Name  Score  Adjusted Score
0    Alice     85              90
1      Bob     90              90
2  Charlie     95              95

## Example 4: Pandas - Merging DataFrames with Different Keys

In [7]:
import pandas as pd

# Creating two DataFrames
df1 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Charlie']})
df2 = pd.DataFrame({'Emp_ID': [2, 3, 4], 'Department': ['HR', 'Finance', 'IT']})
print('Data 1:')
df1

Data 1:

   ID     Name
0   1    Alice
1   2      Bob
2   3  Charlie

In [8]:
print('Data 2:')
df2

Data 2:

   Emp_ID Department
0       2         HR
1       3    Finance
2       4         IT

In [9]:
# Merging with different keys
merged_df = pd.merge(df1, df2, left_on='ID', right_on='Emp_ID', how='outer')

print('Merged DataFrame:')
merged_df

Merged DataFrame:

    ID     Name  Emp_ID Department
0  1.0    Alice     NaN        NaN
1  2.0      Bob     2.0         HR
2  3.0  Charlie     3.0    Finance
3  NaN      NaN     4.0         IT

## Example 5: Pandas - Handling Missing Values with Custom Functions

In [10]:
import pandas as pd
import numpy as np

# Creating a DataFrame with missing values
data = {'Name': ['Alice', 'Bob', np.nan, 'David'], 'Age': [25, np.nan, 35, 40]}
df = pd.DataFrame(data)
print('Data:')
df

Data:

    Name   Age
0  Alice  25.0
1    Bob   NaN
2    NaN  35.0
3  David  40.0

In [11]:
# Filling missing values using a custom function
df['Name'].fillna('Unknown', inplace=True)
df['Age'].fillna(df['Age'].median(), inplace=True)

print('DataFrame after Handling Missing Values:')
df

DataFrame after Handling Missing Values:

C:\Users\farzal\AppData\Local\Temp\ipykernel_548\2503651597.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Name'].fillna('Unknown', inplace=True)
C:\Users\farzal\AppData\Local\Temp\ipykernel_548\2503651597.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].median(), inplace=True)

      Name   Age
0    Alice  25.0
1      Bob  35.0
2  Unknown  35.0
3    David  40.0

## Example 6: Pandas - Pivoting DataFrames

In [12]:
import pandas as pd

# Creating a DataFrame
data = {'Date': ['2023-01-01', '2023-01-02', '2023-01-01', '2023-01-02'],
        'City': ['NY', 'NY', 'LA', 'LA'],
        'Sales': [200, 250, 300, 400]}
df = pd.DataFrame(data)
print('Data:')
df

Data:

         Date City  Sales
0  2023-01-01   NY    200
1  2023-01-02   NY    250
2  2023-01-01   LA    300
3  2023-01-02   LA    400

In [13]:
# Pivoting the DataFrame
pivot_df = df.pivot(index='Date', columns='City', values='Sales')

print('Pivoted DataFrame:')
pivot_df

Pivoted DataFrame:

City         LA   NY
Date
2023-01-01  300  200
2023-01-02  400  250

## Example 7: Pandas - Melting DataFrames

In [14]:
import pandas as pd

# Creating a DataFrame
data = {'ID': [1, 2], 'Math': [90, 80], 'Science': [85, 88]}
df = pd.DataFrame(data)
print('Data')
df

Data

   ID  Math  Science
0   1    90       85
1   2    80       88

In [15]:
# Melting the DataFrame
melted_df = pd.melt(df, id_vars=['ID'], value_vars=['Math', 'Science'], var_name='Subject', value_name='Score')

print('Melted DataFrame:')
melted_df

Melted DataFrame:

   ID  Subject  Score
0   1     Math     90
1   2     Math     80
2   1  Science     85
3   2  Science     88

## Example 8: Pandas - Time-based Indexing and Resampling

In [16]:
import pandas as pd

# Creating a time series DataFrame
date_range = pd.date_range(start='2023-01-01', periods=10, freq='D')
data = {'Sales': [100, 200, 150, 300, 250, 400, 300, 350, 300, 400]}
df = pd.DataFrame(data, index=date_range)
print('Data')
df

Data

            Sales
2023-01-01    100
2023-01-02    200
2023-01-03    150
2023-01-04    300
2023-01-05    250
2023-01-06    400
2023-01-07    300
2023-01-08    350
2023-01-09    300
2023-01-10    400

In [17]:
# Resampling to find weekly sales
weekly_sales = df.resample('W').sum()

print('Weekly Sales:\n')
weekly_sales

Weekly Sales:

            Sales
2023-01-01    100
2023-01-08   1950
2023-01-15    700

## Example 9: Pandas - Conditional Filtering with Multiple Conditions

In [18]:
import pandas as pd

# Creating a DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'], 'Score': [85, 70, 95, 60], 'Passed': [True, False, True, False]}
df = pd.DataFrame(data)
print('Data')
df

Data

      Name  Score  Passed
0    Alice     85    True
1      Bob     70   False
2  Charlie     95    True
3    David     60   False

In [19]:
# Filtering with multiple conditions
filtered_df = df[(df['Score'] > 80) & (df['Passed'] == True)]

print('Filtered DataFrame:\n')
filtered_df

Filtered DataFrame:

      Name  Score  Passed
0    Alice     85    True
2  Charlie     95    True

## Example 10: Pandas - Creating Custom Categorical Data

In [20]:
import pandas as pd

# Creating a DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'], 'Score': [85, 70, 95, 60]}
df = pd.DataFrame(data)
print('Data')
df

Data

      Name  Score
0    Alice     85
1      Bob     70
2  Charlie     95
3    David     60

In [21]:
# Creating a new column with categorical data
df['Performance'] = pd.cut(df['Score'], bins=[0, 70, 90, 100], labels=['Poor', 'Average', 'Excellent'])

print('DataFrame with Categorical Performance:\n')
df

DataFrame with Categorical Performance:

      Name  Score Performance
0    Alice     85     Average
1      Bob     70        Poor
2  Charlie     95   Excellent
3    David     60        Poor

## Example 11: Pandas - Rolling Window Calculations

In [22]:
import pandas as pd

# Creating a time series DataFrame
date_range = pd.date_range(start='2023-01-01', periods=10, freq='D')
data = {'Sales': [100, 200, 150, 300, 250, 400, 300, 350, 300, 400]}
df = pd.DataFrame(data, index=date_range)
print('Data')
df

Data

            Sales
2023-01-01    100
2023-01-02    200
2023-01-03    150
2023-01-04    300
2023-01-05    250
2023-01-06    400
2023-01-07    300
2023-01-08    350
2023-01-09    300
2023-01-10    400

In [23]:
# Calculating a rolling mean with a window of 3 days
df['Rolling Mean'] = df['Sales'].rolling(window=3).mean()

print('DataFrame with Rolling Mean:\n')
df

DataFrame with Rolling Mean:

            Sales  Rolling Mean
2023-01-01    100           NaN
2023-01-02    200           NaN
2023-01-03    150    150.000000
2023-01-04    300    216.666667
2023-01-05    250    233.333333
2023-01-06    400    316.666667
2023-01-07    300    316.666667
2023-01-08    350    350.000000
2023-01-09    300    316.666667
2023-01-10    400    350.000000

## Example 12: Pandas - Shift and Lagging Data

In [24]:
import pandas as pd

# Creating a DataFrame
data = {'Date': pd.date_range(start='2023-01-01', periods=5, freq='D'),
        'Temperature': [30, 32, 35, 33, 31]}
df = pd.DataFrame(data)
print('Data')
df

Data

        Date  Temperature
0 2023-01-01           30
1 2023-01-02           32
2 2023-01-03           35
3 2023-01-04           33
4 2023-01-05           31

In [25]:
# Shifting data by one day to create a lag
df['Prev Day Temp'] = df['Temperature'].shift(1)

print('DataFrame with Shifted Data:\n')
df

DataFrame with Shifted Data:

        Date  Temperature  Prev Day Temp
0 2023-01-01           30            NaN
1 2023-01-02           32           30.0
2 2023-01-03           35           32.0
3 2023-01-04           33           35.0
4 2023-01-05           31           33.0

## Example 13: Pandas - Cumulative Sum and Product

In [26]:
import pandas as pd

# Creating a DataFrame
data = {'Sales': [100, 200, 150, 300, 250]}
df = pd.DataFrame(data)
print('Data')
df

Data

   Sales
0    100
1    200
2    150
3    300
4    250

In [27]:
# Calculating cumulative sum and product
df['Cumulative Sum'] = df['Sales'].cumsum()
df['Cumulative Product'] = df['Sales'].cumprod()

print('DataFrame with Cumulative Operations:\n')
df

DataFrame with Cumulative Operations:

   Sales  Cumulative Sum  Cumulative Product
0    100             100                 100
1    200             300               20000
2    150             450             3000000
3    300             750           900000000
4    250            1000        225000000000

## Example 14: Pandas - Merging on Multiple Columns

In [28]:
import pandas as pd

# Creating two DataFrames
df1 = pd.DataFrame({'ID': [1, 2, 3], 'Year': [2020, 2021, 2021], 'Name': ['Alice', 'Bob', 'Charlie']})
df2 = pd.DataFrame({'ID': [2, 3, 1], 'Year': [2021, 2021, 2020], 'Score': [88, 92, 75]})
print('Data1')
df1

Data1

   ID  Year     Name
0   1  2020    Alice
1   2  2021      Bob
2   3  2021  Charlie

In [29]:
print('Data2')
df2

Data2

   ID  Year  Score
0   2  2021     88
1   3  2021     92
2   1  2020     75

In [30]:
# Merging on multiple columns
merged_df = pd.merge(df1, df2, on=['ID', 'Year'], how='inner')

print('Merged DataFrame on Multiple Columns:\n')
merged_df

Merged DataFrame on Multiple Columns:

   ID  Year     Name  Score
0   1  2020    Alice     75
1   2  2021      Bob     88
2   3  2021  Charlie     92

## Example 15: Pandas - Handling Outliers

In [31]:
import pandas as pd
import numpy as np

# Creating a DataFrame
data = {'Value': [10, 12, 14, 100, 15, 13, 12]}
df = pd.DataFrame(data)
print('Data')
df

Data

   Value
0     10
1     12
2     14
3    100
4     15
5     13
6     12

In [32]:
# Identifying outliers using the IQR method
Q1 = df['Value'].quantile(0.25)
Q3 = df['Value'].quantile(0.75)
IQR = Q3 - Q1
outliers = df[(df['Value'] < (Q1 - 1.5 * IQR)) | (df['Value'] > (Q3 + 1.5 * IQR))]

print('Outliers:\n')
outliers

Outliers:

   Value
3    100

## Example 16: Pandas - Creating a Pivot Table with Multiple Aggregations

In [33]:
import pandas as pd

# Creating a DataFrame
data = {'City': ['NY', 'LA', 'NY', 'SF', 'LA'], 'Year': [2020, 2020, 2021, 2021, 2020], 'Sales': [100, 150, 200, 250, 300]}
df = pd.DataFrame(data)
print('Data')
df

Data

  City  Year  Sales
0   NY  2020    100
1   LA  2020    150
2   NY  2021    200
3   SF  2021    250
4   LA  2020    300

In [34]:
# Creating a pivot table with multiple aggregations
pivot_table = pd.pivot_table(df, values='Sales', index='City', columns='Year', aggfunc=['sum', 'mean'])

print('Pivot Table with Multiple Aggregations:\n')
pivot_table

Pivot Table with Multiple Aggregations:

        sum          mean
Year   2020   2021   2020   2021
City
LA    450.0    NaN  225.0    NaN
NY    100.0  200.0  100.0  200.0
SF      NaN  250.0    NaN  250.0

## Example 17: Pandas - Using map() for Value Replacement

In [35]:
import pandas as pd

# Creating a DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie'], 'Department': ['HR', 'IT', 'Finance']}
df = pd.DataFrame(data)
print('Data')
df

Data

      Name Department
0    Alice         HR
1      Bob         IT
2  Charlie    Finance

In [36]:
# Mapping departments to codes
department_map = {'HR': 1, 'IT': 2, 'Finance': 3}
df['Dept Code'] = df['Department'].map(department_map)

print('DataFrame with Mapped Values:\n')
df

DataFrame with Mapped Values:

      Name Department  Dept Code
0    Alice         HR          1
1      Bob         IT          2
2  Charlie    Finance          3

## Example 18: Pandas - Detecting Duplicates

In [37]:
import pandas as pd

# Creating a DataFrame with duplicate rows
data = {'ID': [1, 2, 2, 3, 4, 4], 'Value': [10, 20, 20, 30, 40, 40]}
df = pd.DataFrame(data)

# Detecting duplicates
duplicates = df[df.duplicated()]

print('Duplicate Rows:\n', duplicates)

Duplicate Rows:
    ID  Value
2   2     20
5   4     40

## Example 19: Pandas - Using Explode for Lists in Columns

In [38]:
import pandas as pd

# Creating a DataFrame with lists in a column
data = {'ID': [1, 2], 'Hobbies': [['Reading', 'Swimming'], ['Running', 'Cycling']]}
df = pd.DataFrame(data)
df

   ID              Hobbies
0   1  [Reading, Swimming]
1   2   [Running, Cycling]

In [39]:
# Exploding the 'Hobbies' column
exploded_df = df.explode('Hobbies')

print('DataFrame after Exploding Lists:\n')
exploded_df

DataFrame after Exploding Lists:

   ID   Hobbies
0   1   Reading
0   1  Swimming
1   2   Running
1   2   Cycling

## Example 20: Pandas - Using Rank to Rank Values

In [40]:
import pandas as pd

# Creating a DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'], 'Score': [85, 90, 78, 92]}
df = pd.DataFrame(data)
print('Data:')
df

Data:

      Name  Score
0    Alice     85
1      Bob     90
2  Charlie     78
3    David     92

In [41]:
# Ranking scores in descending order
df['Rank'] = df['Score'].rank(ascending=False)

print('DataFrame with Ranked Scores:')
df

DataFrame with Ranked Scores:

      Name  Score  Rank
0    Alice     85   3.0
1      Bob     90   2.0
2  Charlie     78   4.0
3    David     92   1.0

## Example 21: Pandas - Using applymap for Element-wise Operations

In [42]:
import pandas as pd

# Creating a DataFrame
data = {'A': [1, 2, 3], 'B': [4, 5, 6]}
df = pd.DataFrame(data)
print('Data:')
df

Data:

   A  B
0  1  4
1  2  5
2  3  6

In [43]:
# Applying an operation to each element in the DataFrame
df_transformed = df.applymap(lambda x: x**2)

print('DataFrame with Squared Values:')
df_transformed

DataFrame with Squared Values:

C:\Users\farzal\AppData\Local\Temp\ipykernel_548\3211642257.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df_transformed = df.applymap(lambda x: x**2)

   A   B
0  1  16
1  4  25
2  9  36

## Example 22: Pandas - Creating Dummy Variables

In [44]:
import pandas as pd

# Creating a DataFrame
data = {'City': ['NY', 'LA', 'SF', 'NY']}
df = pd.DataFrame(data)
print('Data:')
df

Data:

  City
0   NY
1   LA
2   SF
3   NY

In [45]:
# Creating dummy variables
dummies = pd.get_dummies(df['City'], prefix='City')

print('Dummy Variables DataFrame:')
dummies

Dummy Variables DataFrame:

   City_LA  City_NY  City_SF
0    False     True    False
1     True    False    False
2    False    False     True
3    False     True    False

## Example 23: Pandas - Query Method for Conditional Filtering

In [46]:
import pandas as pd

# Creating a DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'], 'Score': [85, 70, 95, 60]}
df = pd.DataFrame(data)
print('Data:')
df

Data:

      Name  Score
0    Alice     85
1      Bob     70
2  Charlie     95
3    David     60

In [47]:
# Using query for filtering
filtered_df = df.query('Score > 80')

print('Filtered DataFrame using query:')
filtered_df

Filtered DataFrame using query:

      Name  Score
0    Alice     85
2  Charlie     95

## Example 24: Pandas - Assign Method for Adding Columns

In [48]:
import pandas as pd

# Creating a DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie'], 'Score': [85, 90, 95]}
df = pd.DataFrame(data)
print('Data:')
df

Data:

      Name  Score
0    Alice     85
1      Bob     90
2  Charlie     95

In [49]:
# Adding a new column using assign
df = df.assign(Grade=lambda x: ['A' if score >= 90 else 'B' for score in x['Score']])

print('DataFrame with Assigned Grade Column:')
df

DataFrame with Assigned Grade Column:

      Name  Score Grade
0    Alice     85     B
1      Bob     90     A
2  Charlie     95     A

## Example 25: Pandas - Using Custom Functions with Groupby

In [50]:
import pandas as pd

# Creating a DataFrame
data = {'Category': ['A', 'A', 'B', 'B'], 'Value': [10, 20, 30, 40]}
df = pd.DataFrame(data)
print('Data:')
df

Data:

  Category  Value
0        A     10
1        A     20
2        B     30
3        B     40

In [51]:
# Applying a custom function with groupby
grouped_df = df.groupby('Category')['Value'].apply(lambda x: x.max() - x.min())

print('Custom Aggregation Result:')
grouped_df

Custom Aggregation Result:

Category
A    10
B    10
Name: Value, dtype: int64

## Example 26: Pandas - DataFrame Info and Memory Usage

In [52]:
import pandas as pd

# Creating a DataFrame
data = {'A': range(1000), 'B': range(1000, 2000)}
df = pd.DataFrame(data)
print('Data:')
df.head(10)

Data:

   A     B
0  0  1000
1  1  1001
2  2  1002
3  3  1003
4  4  1004
5  5  1005
6  6  1006
7  7  1007
8  8  1008
9  9  1009

In [53]:
# Displaying DataFrame info and memory usage
df_info = df.info(memory_usage='deep')

print('\n\nDataFrame Info and Memory Usage:', df_info)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       1000 non-null   int64
 1   B       1000 non-null   int64
dtypes: int64(2)
memory usage: 15.8 KB


DataFrame Info and Memory Usage: None

## Example 27: Pandas - Filtering with isin Method

In [54]:
import pandas as pd

# Creating a DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'], 'City': ['NY', 'LA', 'SF', 'NY']}
df = pd.DataFrame(data)
print('Data:')
df

Data:

      Name City
0    Alice   NY
1      Bob   LA
2  Charlie   SF
3    David   NY

In [55]:
# Filtering with isin
filtered_df = df[df['City'].isin(['NY', 'SF'])]

print('Filtered DataFrame with isin Method:')
filtered_df

Filtered DataFrame with isin Method:

      Name City
0    Alice   NY
2  Charlie   SF
3    David   NY

## Example 28: Pandas - Concatenating DataFrames

In [56]:
import pandas as pd

# Creating DataFrames
df1 = pd.DataFrame({'A': [1, 2], 'B': [3, 4]})
df2 = pd.DataFrame({'A': [5, 6], 'B': [7, 8]})
print(f'Data1:\n{df1}\n\nData2:\n{df2}')

Data1:
   A  B
0  1  3
1  2  4

Data2:
   A  B
0  5  7
1  6  8

In [57]:
# Concatenating DataFrames
concat_df = pd.concat([df1, df2], ignore_index=True)

print('Concatenated DataFrame:')
concat_df

Concatenated DataFrame:

   A  B
0  1  3
1  2  4
2  5  7
3  6  8

## Example 29: Pandas - Sorting by Multiple Columns

In [58]:
import pandas as pd

# Creating a DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'], 'Score': [85, 70, 95, 85], 'Age': [25, 30, 35, 22]}
df = pd.DataFrame(data)
print('Data:')
df

Data:

      Name  Score  Age
0    Alice     85   25
1      Bob     70   30
2  Charlie     95   35
3    David     85   22

In [59]:
# Sorting by multiple columns
sorted_df = df.sort_values(by=['Score', 'Age'], ascending=[False, True])

print('Sorted DataFrame by Multiple Columns:\n')
sorted_df

Sorted DataFrame by Multiple Columns:

      Name  Score  Age
2  Charlie     95   35
3    David     85   22
0    Alice     85   25
1      Bob     70   30

## Example 30: Pandas - Using style for DataFrame Styling

In [60]:
import pandas as pd

# Creating a DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'], 'Score': [85, 70, 95, 60]}
df = pd.DataFrame(data)
print('Data:')
df

Data:

      Name  Score
0    Alice     85
1      Bob     70
2  Charlie     95
3    David     60

In [61]:
# Applying styles to highlight scores above 80
styled_df = df.style.applymap(lambda x: 'background-color: yellow' if isinstance(x, int) and x > 80 else '')

# Display the styled DataFrame (use .render() if exporting to HTML)
print('Styled DataFrame with Conditional Formatting')
styled_df

Styled DataFrame with Conditional Formatting

C:\Users\farzal\AppData\Local\Temp\ipykernel_548\1633350601.py:2: FutureWarning: Styler.applymap has been deprecated. Use Styler.map instead.
  styled_df = df.style.applymap(lambda x: 'background-color: yellow' if isinstance(x, int) and x > 80 else '')

## Example 31: Pandas - Using explode() for Nested JSON Columns

In [62]:
import pandas as pd

# Creating a DataFrame with nested lists
data = {'ID': [1, 2], 'Hobbies': [['Reading', 'Swimming', 'Gaming'], ['Hiking', 'Drawing']]}
df = pd.DataFrame(data)
print('Data:')
df

Data:

   ID                      Hobbies
0   1  [Reading, Swimming, Gaming]
1   2            [Hiking, Drawing]

In [63]:
# Exploding the 'Hobbies' column
exploded_df = df.explode('Hobbies')

print('DataFrame after Exploding Nested JSON Column:\n')
exploded_df

DataFrame after Exploding Nested JSON Column:

   ID   Hobbies
0   1   Reading
0   1  Swimming
0   1    Gaming
1   2    Hiking
1   2   Drawing

## Example 32: Pandas - Using pipe() for Method Chaining

In [64]:
import pandas as pd

# Creating a DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie'], 'Score': [85, 70, 95]}
df = pd.DataFrame(data)
print('Data:')
df

Data:

      Name  Score
0    Alice     85
1      Bob     70
2  Charlie     95

In [65]:
# Custom function for modifying the DataFrame
def add_grade_column(df):
    df['Grade'] = df['Score'].apply(lambda x: 'A' if x >= 90 else 'B')
    return df

# Using pipe for method chaining
df = df.pipe(add_grade_column)

print('DataFrame after Using pipe():')
df

DataFrame after Using pipe():

      Name  Score Grade
0    Alice     85     B
1      Bob     70     B
2  Charlie     95     A

## Example 33: Pandas - MultiIndex Slicing

In [66]:
import pandas as pd

# Creating a MultiIndex DataFrame
arrays = [['A', 'A', 'B', 'B'], [2020, 2021, 2020, 2021]]
index = pd.MultiIndex.from_arrays(arrays, names=('Category', 'Year'))
data = [100, 150, 200, 250]
df = pd.DataFrame(data, index=index, columns=['Sales'])
print('Data:')
df

Data:

               Sales
Category Year
A        2020    100
         2021    150
B        2020    200
         2021    250

In [67]:
# Slicing the MultiIndex DataFrame
sliced_df = df.loc['A']

print('Sliced MultiIndex DataFrame:')
sliced_df

Sliced MultiIndex DataFrame:

      Sales
Year
2020    100
2021    150

## Example 34: Pandas - Adding a Prefix or Suffix to Column Names

In [68]:
import pandas as pd

# Creating a DataFrame
data = {'Math': [90, 80], 'Science': [85, 88]}
df = pd.DataFrame(data)
print('Data:')
df

Data:

   Math  Science
0    90       85
1    80       88

In [69]:
# Adding a prefix to column names
df_prefixed = df.add_prefix('Grade_')

print('DataFrame with Prefix:\n')
df_prefixed

DataFrame with Prefix:

   Grade_Math  Grade_Science
0          90             85
1          80             88

In [70]:
# Adding a suffix to column names
df_suffixed = df.add_suffix('_Score')

print('DataFrame with Suffix:\n')
df_suffixed

DataFrame with Suffix:

   Math_Score  Science_Score
0          90             85
1          80             88

## Example 35: Pandas - Using at and iat for Fast Scalar Access

In [71]:
import pandas as pd

# Creating a DataFrame
data = {'A': [1, 2, 3], 'B': [4, 5, 6]}
df = pd.DataFrame(data)
print('Data:')
df

Data:

   A  B
0  1  4
1  2  5
2  3  6

In [72]:
# Accessing a single value using at and iat
value_at = df.at[1, 'A']

print('Value using at:')
value_at

Value using at:

2

In [73]:
value_iat = df.iat[1, 0]

print('Value using iat:')
value_iat

Value using iat:

2

## Example 36: Pandas - Renaming Index and Columns

In [74]:
import pandas as pd

# Creating a DataFrame
data = {'Name': ['Alice', 'Bob'], 'Score': [85, 90]}
df = pd.DataFrame(data, index=['Row1', 'Row2'])
print('Data:')
df

Data:

       Name  Score
Row1  Alice     85
Row2    Bob     90

In [75]:
# Renaming index and columns
df_renamed = df.rename(index={'Row1': 'Student1', 'Row2': 'Student2'}, columns={'Score': 'Grade'})

print('Renamed DataFrame:')
df_renamed

Renamed DataFrame:

           Name  Grade
Student1  Alice     85
Student2    Bob     90

## Example 37: Pandas - Using query() with Variables

In [76]:
import pandas as pd

# Creating a DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie'], 'Score': [85, 70, 95]}
df = pd.DataFrame(data)
print('Data:')
df

Data:

      Name  Score
0    Alice     85
1      Bob     70
2  Charlie     95

In [77]:
# Using query() with variables
threshold = 80
filtered_df = df.query('Score > @threshold')

print('Filtered DataFrame with query() and Variables:')
filtered_df

Filtered DataFrame with query() and Variables:

      Name  Score
0    Alice     85
2  Charlie     95

## Example 38: Pandas - Creating Custom Aggregations with Groupby

In [78]:
import pandas as pd

# Creating a DataFrame
data = {'Category': ['A', 'A', 'B', 'B'], 'Value': [10, 20, 30, 40]}
df = pd.DataFrame(data)
print('Data:')
df

Data:

  Category  Value
0        A     10
1        A     20
2        B     30
3        B     40

In [79]:
# Using groupby with custom aggregation
custom_agg = df.groupby('Category').agg(max_value=('Value', 'max'), min_value=('Value', 'min'))

print('Custom Aggregation Result:')
custom_agg

Custom Aggregation Result:

          max_value  min_value
Category
A                20         10
B                40         30

## Example 39: Pandas - Pivoting with fill_value

In [80]:
import pandas as pd

# Creating a DataFrame
data = {'Date': ['2023-01-01', '2023-01-02', '2023-01-01', '2023-01-02'],
        'City': ['NY', 'NY', 'LA', 'LA'], 'Sales': [200, 250, 300, None]}
df = pd.DataFrame(data)
print('Data:')
df

Data:

         Date City  Sales
0  2023-01-01   NY  200.0
1  2023-01-02   NY  250.0
2  2023-01-01   LA  300.0
3  2023-01-02   LA    NaN

In [81]:
# Pivoting with fill_value
pivot_df = df.pivot(index='Date', columns='City', values='Sales').fillna(0)

print('Pivoted DataFrame with fill_value:')
pivot_df

Pivoted DataFrame with fill_value:

City           LA     NY
Date
2023-01-01  300.0  200.0
2023-01-02    0.0  250.0

## Example 40: Pandas - Using drop_duplicates() for Unique Rows

In [82]:
import pandas as pd

# Creating a DataFrame with duplicate rows
data = {'Name': ['Alice', 'Bob', 'Alice', 'Charlie'], 'Score': [85, 70, 85, 95]}
df = pd.DataFrame(data)
print('Data:')
df

Data:

      Name  Score
0    Alice     85
1      Bob     70
2    Alice     85
3  Charlie     95

In [83]:
# Dropping duplicate rows
unique_df = df.drop_duplicates()

print('DataFrame after Dropping Duplicates:')
unique_df

DataFrame after Dropping Duplicates:

      Name  Score
0    Alice     85
1      Bob     70
3  Charlie     95

## Example 41: Pandas - Combining DataFrames with Multi-level Indexes

In [84]:
import pandas as pd

# Creating DataFrames with MultiIndex
arrays = [['A', 'A', 'B', 'B'], [2020, 2021, 2020, 2021]]
index = pd.MultiIndex.from_arrays(arrays, names=('Category', 'Year'))
data1 = [100, 150, 200, 250]
df1 = pd.DataFrame(data1, index=index, columns=['Sales'])
print('Data1:')
df1

Data1:

               Sales
Category Year
A        2020    100
         2021    150
B        2020    200
         2021    250

In [85]:
data2 = [300, 400, 500, 600]
df2 = pd.DataFrame(data2, index=index, columns=['Profit'])
print('Data2:')
df2

Data2:

               Profit
Category Year
A        2020     300
         2021     400
B        2020     500
         2021     600

In [86]:
# Combining DataFrames
combined_df = pd.concat([df1, df2], axis=1)

print('Combined DataFrame with Multi-level Indexes:')
combined_df

Combined DataFrame with Multi-level Indexes:

               Sales  Profit
Category Year
A        2020    100     300
         2021    150     400
B        2020    200     500
         2021    250     600

## Example 42: Pandas - Using rolling() with Custom Functions

In [87]:
import pandas as pd

# Creating a time series DataFrame
date_range = pd.date_range(start='2023-01-01', periods=10, freq='D')
data = {'Values': [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]}
df = pd.DataFrame(data, index=date_range)
print('Data:')
df

Data:

            Values
2023-01-01      10
2023-01-02      20
2023-01-03      30
2023-01-04      40
2023-01-05      50
2023-01-06      60
2023-01-07      70
2023-01-08      80
2023-01-09      90
2023-01-10     100

In [88]:
# Applying a custom function with rolling()
df['Rolling Sum'] = df['Values'].rolling(window=3).apply(lambda x: x.sum() if x.sum() > 50 else 0)

print('DataFrame with Custom Rolling Sum:')
df

DataFrame with Custom Rolling Sum:

            Values  Rolling Sum
2023-01-01      10          NaN
2023-01-02      20          NaN
2023-01-03      30         60.0
2023-01-04      40         90.0
2023-01-05      50        120.0
2023-01-06      60        150.0
2023-01-07      70        180.0
2023-01-08      80        210.0
2023-01-09      90        240.0
2023-01-10     100        270.0

## Example 43: Pandas - Using pivot_table with Multiple Indexes

In [89]:
import pandas as pd

# Creating a DataFrame
data = {'City': ['NY', 'LA', 'NY', 'SF', 'LA'], 'Year': [2020, 2020, 2021, 2021, 2020], 'Sales': [100, 150, 200, 250, 300]}
df = pd.DataFrame(data)
print('Data:')
df

Data:

  City  Year  Sales
0   NY  2020    100
1   LA  2020    150
2   NY  2021    200
3   SF  2021    250
4   LA  2020    300

In [90]:
# Creating a pivot table with multiple indexes
pivot_table = pd.pivot_table(df, values='Sales', index=['City', 'Year'], aggfunc='sum')

print('Pivot Table with Multiple Indexes:')
pivot_table

Pivot Table with Multiple Indexes:

           Sales
City Year
LA   2020    450
NY   2020    100
     2021    200
SF   2021    250

## Example 44: Pandas - Resampling with Different Aggregations

In [91]:
import pandas as pd

# Creating a time series DataFrame
date_range = pd.date_range(start='2023-01-01', periods=30, freq='D')
data = {'Sales': range(30)}
df = pd.DataFrame(data, index=date_range)
print('Data:')
df

Data:

            Sales
2023-01-01      0
2023-01-02      1
2023-01-03      2
2023-01-04      3
2023-01-05      4
2023-01-06      5
2023-01-07      6
2023-01-08      7
2023-01-09      8
2023-01-10      9
2023-01-11     10
2023-01-12     11
2023-01-13     12
2023-01-14     13
2023-01-15     14
2023-01-16     15
2023-01-17     16
2023-01-18     17
2023-01-19     18
2023-01-20     19
2023-01-21     20
2023-01-22     21
2023-01-23     22
2023-01-24     23
2023-01-25     24
2023-01-26     25
2023-01-27     26
2023-01-28     27
2023-01-29     28
2023-01-30     29

In [92]:
# Resampling with different aggregations
resampled_df = df.resample('W').agg({'Sales': ['sum', 'mean', 'max']})

print('Resampled DataFrame with Different Aggregations:')
resampled_df

Resampled DataFrame with Different Aggregations:

           Sales
             sum  mean max
2023-01-01     0   0.0   0
2023-01-08    28   4.0   7
2023-01-15    77  11.0  14
2023-01-22   126  18.0  21
2023-01-29   175  25.0  28
2023-02-05    29  29.0  29

## Example 45: Pandas - Setting and Resetting Indexes

In [93]:
import pandas as pd

# Creating a DataFrame
data = {'City': ['NY', 'LA', 'SF'], 'Year': [2020, 2021, 2021], 'Sales': [100, 200, 300]}
df = pd.DataFrame(data)
print('Data:')
df

Data:

  City  Year  Sales
0   NY  2020    100
1   LA  2021    200
2   SF  2021    300

In [94]:
# Setting an index
df.set_index('City', inplace=True)

print('DataFrame after Setting Index:')
df

DataFrame after Setting Index:

      Year  Sales
City
NY    2020    100
LA    2021    200
SF    2021    300

In [95]:
# Resetting the index
df.reset_index(inplace=True)

print('DataFrame after Resetting Index:\n')
df

DataFrame after Resetting Index:

  City  Year  Sales
0   NY  2020    100
1   LA  2021    200
2   SF  2021    300

## Example 46: Pandas - Working with Time Zones

In [96]:
import pandas as pd

# Creating a time series with a timezone
date_range = pd.date_range(start='2023-01-01', periods=5, freq='D', tz='UTC')
data = {'Sales': [100, 200, 150, 300, 250]}
df = pd.DataFrame(data, index=date_range)
print('Data:')
df

Data:

                           Sales
2023-01-01 00:00:00+00:00    100
2023-01-02 00:00:00+00:00    200
2023-01-03 00:00:00+00:00    150
2023-01-04 00:00:00+00:00    300
2023-01-05 00:00:00+00:00    250

In [97]:
# Converting to a different timezone
df = df.tz_convert('US/Eastern')

print('Time Series DataFrame with Time Zones:')
df

Time Series DataFrame with Time Zones:

                           Sales
2022-12-31 19:00:00-05:00    100
2023-01-01 19:00:00-05:00    200
2023-01-02 19:00:00-05:00    150
2023-01-03 19:00:00-05:00    300
2023-01-04 19:00:00-05:00    250

## Example 47: Pandas - Using pd.cut for Binning Data

In [98]:
import pandas as pd

# Creating a DataFrame
data = {'Scores': [50, 60, 70, 80, 90, 100]}
df = pd.DataFrame(data)
print('Data:')
df

Data:

   Scores
0      50
1      60
2      70
3      80
4      90
5     100

In [99]:
# Binning the scores into categories
df['Grade'] = pd.cut(df['Scores'], bins=[0, 59, 69, 79, 89, 100], labels=['F', 'D', 'C', 'B', 'A'])

print('DataFrame with Binned Scores:')
df

DataFrame with Binned Scores:

   Scores Grade
0      50     F
1      60     D
2      70     C
3      80     B
4      90     A
5     100     A

## Example 48: Pandas - Detecting and Replacing Outliers

In [100]:
import pandas as pd
import numpy as np

# Creating a DataFrame
data = {'Values': [10, 12, 14, 100, 15, 13, 12]}
df = pd.DataFrame(data)
print('Data:')
df

Data:

   Values
0      10
1      12
2      14
3     100
4      15
5      13
6      12

In [101]:
# Detecting outliers using the IQR method
Q1 = df['Values'].quantile(0.25)
Q3 = df['Values'].quantile(0.75)
IQR = Q3 - Q1
outliers = (df['Values'] < (Q1 - 1.5 * IQR)) | (df['Values'] > (Q3 + 1.5 * IQR))

# Replacing outliers with the median
df.loc[outliers, 'Values'] = df['Values'].median()

print('DataFrame after Replacing Outliers:')
df

DataFrame after Replacing Outliers:

   Values
0      10
1      12
2      14
3      13
4      15
5      13
6      12

## Example 49: Pandas - Using DataFrame.eval for Efficient Calculations

In [102]:
import pandas as pd

# Creating a DataFrame
data = {'A': [1, 2, 3, 4], 'B': [5, 6, 7, 8]}
df = pd.DataFrame(data)
print('Data:')
df

Data:

   A  B
0  1  5
1  2  6
2  3  7
3  4  8

In [103]:
# Using eval for calculations
df['C'] = df.eval('A + B * 2')

print('DataFrame with Evaluated Calculations:')
df

DataFrame with Evaluated Calculations:

   A  B   C
0  1  5  11
1  2  6  14
2  3  7  17
3  4  8  20

## Example 50: Pandas - Applying Functions to Grouped Data

In [104]:
import pandas as pd

# Creating a DataFrame
data = {'Team': ['A', 'A', 'B', 'B', 'C'], 'Points': [10, 15, 20, 25, 30]}
df = pd.DataFrame(data)
print('Data:')
df

Data:

  Team  Points
0    A      10
1    A      15
2    B      20
3    B      25
4    C      30

In [105]:
# Applying a function to grouped data
grouped_df = df.groupby('Team')['Points'].transform(lambda x: x / x.max())

print('DataFrame with Applied Functions to Grouped Data:')
grouped_df

DataFrame with Applied Functions to Grouped Data:

0    0.666667
1    1.000000
2    0.800000
3    1.000000
4    1.000000
Name: Points, dtype: float64

## Example 51: Pandas - Using df.apply with Axis Parameter

In [106]:
import pandas as pd

# Creating a DataFrame
data = {'A': [1, 2, 3], 'B': [4, 5, 6]}
df = pd.DataFrame(data)
print('Data:')
df

Data:

   A  B
0  1  4
1  2  5
2  3  6

In [107]:
# Applying a function to rows and columns using the axis parameter
row_sum = df.apply(lambda x: x.sum(), axis=1)
print('Row-wise Sum:')
row_sum

Row-wise Sum:

0    5
1    7
2    9
dtype: int64

In [108]:
col_sum = df.apply(lambda x: x.sum(), axis=0)
print('Column-wise Sum:')
col_sum

Column-wise Sum:

A     6
B    15
dtype: int64

## Example 52: Pandas - Merging with Indicator for Tracking Source

In [109]:
import pandas as pd

# Creating first DataFrame
df1 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Charlie']})
print('Data1:')
df1

Data1:

   ID     Name
0   1    Alice
1   2      Bob
2   3  Charlie

In [110]:
# Creating second DataFrame
df2 = pd.DataFrame({'ID': [3, 4, 5], 'Name': ['Charlie', 'David', 'Edward']})
print('Data2:')
df2

Data2:

   ID     Name
0   3  Charlie
1   4    David
2   5   Edward

In [111]:
# Merging with indicator to track the source
merged_df = pd.merge(df1, df2, on='ID', how='outer', indicator=True)

print('Merged DataFrame with Indicator:')
merged_df

Merged DataFrame with Indicator:

   ID   Name_x   Name_y      _merge
0   1    Alice      NaN   left_only
1   2      Bob      NaN   left_only
2   3  Charlie  Charlie        both
3   4      NaN    David  right_only
4   5      NaN   Edward  right_only

## Example 53: Pandas - Creating Time Series with Business Days

In [112]:
import pandas as pd

# Creating a time series with business days only
date_range = pd.date_range(start='2023-01-01', periods=10, freq='B')
data = {'Sales': range(10)}
df = pd.DataFrame(data, index=date_range)
print('Time Series DataFrame with Business Days:')
df

Time Series DataFrame with Business Days:

            Sales
2023-01-02      0
2023-01-03      1
2023-01-04      2
2023-01-05      3
2023-01-06      4
2023-01-09      5
2023-01-10      6
2023-01-11      7
2023-01-12      8
2023-01-13      9

## Example 54: Pandas - Applying Multiple Functions with Groupby

In [113]:
import pandas as pd

# Creating a DataFrame
data = {'Category': ['A', 'A', 'B', 'B'], 'Value': [10, 20, 30, 40]}
df = pd.DataFrame(data)
print('Data:')
df

Data:

  Category  Value
0        A     10
1        A     20
2        B     30
3        B     40

In [114]:
# Applying multiple functions with groupby
grouped_df = df.groupby('Category')['Value'].agg(['mean', 'sum', 'max'])

print('Grouped DataFrame with Multiple Functions:')
grouped_df

Grouped DataFrame with Multiple Functions:

          mean  sum  max
Category
A         15.0   30   20
B         35.0   70   40

## Example 55: Pandas - Using df.pivot with MultiIndex Columns

In [115]:
import pandas as pd

# Creating a DataFrame
data = {'Date': ['2023-01-01', '2023-01-02', '2023-01-01', '2023-01-02'],
        'City': ['NY', 'NY', 'LA', 'LA'], 'Type': ['Online', 'Store', 'Online', 'Store'], 'Sales': [200, 250, 300, 350]}
df = pd.DataFrame(data)
print('Data:')
df

Data:

         Date City    Type  Sales
0  2023-01-01   NY  Online    200
1  2023-01-02   NY   Store    250
2  2023-01-01   LA  Online    300
3  2023-01-02   LA   Store    350

In [116]:
# Pivoting to create a DataFrame with MultiIndex columns
pivot_df = df.pivot(index='Date', columns=['City', 'Type'], values='Sales')

print('Pivoted DataFrame with MultiIndex Columns:')
pivot_df

Pivoted DataFrame with MultiIndex Columns:

City           NY            LA
Type       Online  Store Online  Store
Date
2023-01-01  200.0    NaN  300.0    NaN
2023-01-02    NaN  250.0    NaN  350.0

## Example 56: Pandas - Stacking and Unstacking DataFrames

In [117]:
import pandas as pd

# Creating a DataFrame
data = {'City': ['NY', 'LA'], '2020': [100, 150], '2021': [200, 250]}
df = pd.DataFrame(data).set_index('City')
print('Data:')
df

Data:

      2020  2021
City
NY     100   200
LA     150   250

In [118]:
# Stacking the DataFrame
stacked_df = df.stack()
print('Stacked DataFrame:')
stacked_df

Stacked DataFrame:

City
NY    2020    100
      2021    200
LA    2020    150
      2021    250
dtype: int64

In [119]:
#Unstacking the DataFrame
unstacked_df = stacked_df.unstack()
print('Unstacked DataFrame:')
unstacked_df

Unstacked DataFrame:

      2020  2021
City
NY     100   200
LA     150   250

## Example 57: Pandas - Using ffill and bfill for Missing Values

In [120]:
import pandas as pd
import numpy as np

# Creating a DataFrame with missing values
data = {'A': [1, np.nan, 3], 'B': [4, 5, np.nan]}
df = pd.DataFrame(data)
print('Data:')
df

Data:

     A    B
0  1.0  4.0
1  NaN  5.0
2  3.0  NaN

In [121]:
# Using ffill to fill missing values

df_ffill = df.fillna(method='ffill')
print('DataFrame with Forward Fill:')
df_ffill

DataFrame with Forward Fill:

C:\Users\farzal\AppData\Local\Temp\ipykernel_548\2486686591.py:3: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_ffill = df.fillna(method='ffill')

     A    B
0  1.0  4.0
1  1.0  5.0
2  3.0  5.0

In [122]:
# Using  bfill to fill missing values

df_bfill = df.fillna(method='bfill')
print('DataFrame with Backward Fill:')
df_bfill

DataFrame with Backward Fill:

C:\Users\farzal\AppData\Local\Temp\ipykernel_548\3903016168.py:3: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_bfill = df.fillna(method='bfill')

     A    B
0  1.0  4.0
1  3.0  5.0
2  3.0  NaN

## Example 58: Pandas - Using melt() to Reshape Data

In [123]:
import pandas as pd

# Creating a DataFrame
data = {'ID': [1, 2], 'Math': [90, 80], 'Science': [85, 88]}
df = pd.DataFrame(data)
print('Data:')
df

Data:

   ID  Math  Science
0   1    90       85
1   2    80       88

In [124]:
# Melting the DataFrame
melted_df = pd.melt(df, id_vars=['ID'], var_name='Subject', value_name='Score')

print('Melted DataFrame:')
melted_df

Melted DataFrame:

   ID  Subject  Score
0   1     Math     90
1   2     Math     80
2   1  Science     85
3   2  Science     88

## Example 59: Pandas - Using shift() for Time Series Analysis

In [125]:
import pandas as pd

# Creating a time series DataFrame
date_range = pd.date_range(start='2023-01-01', periods=5, freq='D')
data = {'Sales': [200, 250, 300, 350, 400]}
df = pd.DataFrame(data, index=date_range)
print('Data:')
df

Data:

            Sales
2023-01-01    200
2023-01-02    250
2023-01-03    300
2023-01-04    350
2023-01-05    400

In [126]:
# Shifting the data to create a lag
df['Previous Day Sales'] = df['Sales'].shift(1)

print('DataFrame with Shifted Time Series Data:')
df

DataFrame with Shifted Time Series Data:

            Sales  Previous Day Sales
2023-01-01    200                 NaN
2023-01-02    250               200.0
2023-01-03    300               250.0
2023-01-04    350               300.0
2023-01-05    400               350.0

## Example 60: Pandas - Creating Custom Indexes with MultiIndex

In [127]:
import pandas as pd

# Creating a MultiIndex from tuples
index = pd.MultiIndex.from_tuples([('A', 2020), ('A', 2021), ('B', 2020), ('B', 2021)], names=['Category', 'Year'])
data = [100, 150, 200, 250]
df = pd.DataFrame(data, index=index, columns=['Sales'])

print('DataFrame with Custom MultiIndex:')
df

DataFrame with Custom MultiIndex:

               Sales
Category Year
A        2020    100
         2021    150
B        2020    200
         2021    250